beomodern/Main_uP/codegentemp/PSoC_LED_PM.c
/*******************************************************************************
* File Name: PSoC_LED.c  
* Version 2.20
*
* Description:
*  This file contains APIs to set up the Pins component for low power modes.
*
* Note:
*
********************************************************************************
* Copyright 2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#include "cytypes.h"
#include "PSoC_LED.h"

static PSoC_LED_BACKUP_STRUCT  PSoC_LED_backup = {0u, 0u, 0u};


/*******************************************************************************
* Function Name: PSoC_LED_Sleep
****************************************************************************//**
*
* \brief Stores the pin configuration and prepares the pin for entering chip 
*  deep-sleep/hibernate modes. This function applies only to SIO and USBIO pins.
*  It should not be called for GPIO or GPIO_OVT pins.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None 
*  
* \sideeffect
*  For SIO pins, this function configures the pin input threshold to CMOS and
*  drive level to Vddio. This is needed for SIO pins when in device 
*  deep-sleep/hibernate modes.
*
* \funcusage
*  \snippet PSoC_LED_SUT.c usage_PSoC_LED_Sleep_Wakeup
*******************************************************************************/
void PSoC_LED_Sleep(void)
{
    #if defined(PSoC_LED__PC)
        PSoC_LED_backup.pcState = PSoC_LED_PC;
    #else
        #if (CY_PSOC4_4200L)
            /* Save the regulator state and put the PHY into suspend mode */
            PSoC_LED_backup.usbState = PSoC_LED_CR1_REG;
            PSoC_LED_USB_POWER_REG |= PSoC_LED_USBIO_ENTER_SLEEP;
            PSoC_LED_CR1_REG &= PSoC_LED_USBIO_CR1_OFF;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(PSoC_LED__SIO)
        PSoC_LED_backup.sioState = PSoC_LED_SIO_REG;
        /* SIO requires unregulated output buffer and single ended input buffer */
        PSoC_LED_SIO_REG &= (uint32)(~PSoC_LED_SIO_LPM_MASK);
    #endif  
}


/*******************************************************************************
* Function Name: PSoC_LED_Wakeup
****************************************************************************//**
*
* \brief Restores the pin configuration that was saved during Pin_Sleep(). This 
* function applies only to SIO and USBIO pins. It should not be called for
* GPIO or GPIO_OVT pins.
*
* For USBIO pins, the wakeup is only triggered for falling edge interrupts.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None
*  
* \funcusage
*  Refer to PSoC_LED_Sleep() for an example usage.
*******************************************************************************/
void PSoC_LED_Wakeup(void)
{
    #if defined(PSoC_LED__PC)
        PSoC_LED_PC = PSoC_LED_backup.pcState;
    #else
        #if (CY_PSOC4_4200L)
            /* Restore the regulator state and come out of suspend mode */
            PSoC_LED_USB_POWER_REG &= PSoC_LED_USBIO_EXIT_SLEEP_PH1;
            PSoC_LED_CR1_REG = PSoC_LED_backup.usbState;
            PSoC_LED_USB_POWER_REG &= PSoC_LED_USBIO_EXIT_SLEEP_PH2;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(PSoC_LED__SIO)
        PSoC_LED_SIO_REG = PSoC_LED_backup.sioState;
    #endif
}


/* [] END OF FILE */
